quest_system_743944349_name=^?^Lost Town Chronicles
quest_system_743944349_stage_0=^?^Find the Witch Chvakha and ask her for the chronicles.
quest_system_743944349_stage_1=^?^Recover the chronicles from the crypt, which is near the deserted prison. The crypt is enchanted by the witch's spells, and marked by a skull on its roof.
quest_system_743944349_stage_2=^?^Bring the chronicles to Shivarius.
quest_system_743944349_task=^?^Mage Shivarius, from the Darion School of Magic, has asked you to bring him the "Chronicles of the Lost Town." The witch Chvakha, of the Marshan Swamp, is the one most likely to possess these chronicles.<br>[reward]
